# Installing and importing packages

In [61]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\hasee\anaconda3\lib\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [62]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, Table, Column, Integer, String, Float, MetaData, Date
import pymysql
from datetime import datetime, timedelta

# Connecting with the MySQL server

In [64]:
# Define your MySQL connection parameters
MYSQL_USER = 'root'
MYSQL_PASSWORD = 'Valarstark1*'
MYSQL_HOST = 'localhost'
MYSQL_PORT = 3306
MYSQL_DATABASE = 'walmart_sales_db'

In [65]:
# Establish connection
connection = pymysql.connect(
  host = MYSQL_HOST,
  user = MYSQL_USER,
  password = MYSQL_PASSWORD
)

# Create a cursor object to interact with the database
cursor = connection.cursor()

# Creating the database

In [67]:
# Create a new database
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {MYSQL_DATABASE}")

1

# Importing the excel/csv files as pandas dataframes

In [69]:
# Reading the CSV file in pandas dataframe
df = pd.read_csv('Walmart_Sales.csv')
df.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106

# Loading the dataframes into the MySQL Database as tables

In [71]:
# Create a connection to lead the dataframe to MySQL
engine = create_engine(f'mysql+pymysql://{MYSQL_USER}:{MYSQL_PASSWORD}@{MYSQL_HOST}:{MYSQL_PORT}/{MYSQL_DATABASE}')

In [72]:
with engine.connect() as connection:
    # Load DataFrame to SQL
    df.to_sql("walmart_sales", connection, if_exists="append", index=False)